Stdout gets written into a file, stderr gets passes through

#+begin_src python :exports output :results replace raw
import exportwrapper 
return exportwrapper.__doc__
#+end_src

#+RESULTS:

Helper script to run your data exports.

You can read more on how it's used [[https://beepb00p.xyz/exports.html][here]].
# TODO more specific link?

* Dependencies
- =pip3 install --user atomicwrites=

  [[https://github.com/untitaker/python-atomicwrites][atomicwrites]] is a library for portable atomic file writing
- =pip3 install --user backoff=

  [[https://github.com/litl/backoff][backoff]] is a library to simplify backoff and retrying
- =apt install atools=

  [[https://www.nongnu.org/atool][atool]] is a tool to create archives in any format


#+begin_src sh :results output replace :exports output
./exportwrapper.py --help
#+end_src

#+RESULTS:
#+begin_example
usage: exportwrapper.py [-h] [-r RETRIES] [-c COMPRESSION] path ...

Wrapper for automating boilerplate for reliable and regular data exports.

Example: exportwrapper '/exports/rtm/{utcnow}.ical.xz' --compression xz --retries 3 -- /soft/export/rememberthemilk.py

positional arguments:
  path                  Path with borg-style placeholders. Supported: {utcnow}, {hostname}.
                        
                        Example: '/exports/pocket/pocket_{utcnow}.json'
                        
                        (see https://manpages.debian.org/testing/borgbackup/borg-placeholders.1.en.html)
  command               Rest of the arguments are treated as the command to run

optional arguments:
  -h, --help            show this help message and exit
  -r RETRIES, --retries RETRIES
                        Number of retries (exponential backoff)
  -c COMPRESSION, --compression COMPRESSION
                        Set compression format (passed to 'apack -F').
                        
                        See man apack for list of supported formats.
#+end_example

  
